Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailMaterial(Autodesk.Revit.DB.ElementId)
Checks whether an ElementId is a valid material Id of a non-continuous rail.
materialId:
The material Id to be checked.
Returns:
True if the ElementId refers to a valid material or it is invalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailProfile(Autodesk.Revit.DB.ElementId)
Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
Remarks:
Autodesk.Revit.DB.ElementId.InvalidElementId is considered a valid NonContinuousRail profile (the default profile).
profileId:
The profile Id to be checked.
Returns:
True if the ElementId refers to a valid NonContinuousRail profile, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailName(System.String)
Checks whether the input name is valid for a non-continuous rail in its associated railing type.
Remarks:
The name must be unique within the Autodesk::Revit::DB::Architecture::RailingType
to which the non-continuous rail belongs.
name:
The name to be checked.
Returns:
True if the name is unique for the Autodesk::Revit::DB::Architecture::RailingType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailHeight(System.Double)
Checks whether the input height is valid for a non-continuous rail in its associated railing type.
Remarks:
The height cannot be greater than the height of a Autodesk::Revit::DB::Architecture::RailingType
to which the non-continuous rail belongs.
height:
The height to be checked.
Returns:
True if the height is smaller than the height of Autodesk::Revit::DB::Architecture::RailingType, false otherwise.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.MaterialId
The material id associated with the non-continuous rail, or invalidElementId if none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The materialId is not a valid value to be used as a non-continuous rail material Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.ProfileId
The profile id of the non-continuous rail, or invalidElementId if none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profileId is not an Id of a valid NonContinuousRail profile.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Offset
The side offset of the non-continuous rail from a Autodesk::Revit::DB::Architecture::Railing from the railing center.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Height
The height at which the non-continuous rail will be placed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The height height is not valid for the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for height must be no more than 30000 feet in absolute value.
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Name
The name of the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The name name is not valid for the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo
A class which contains information needed to define a single non-continuous rail in a Autodesk::Revit::DB::Architecture::RailingType.
Since:
2019